taskt/Core/Automation/Commands/ColorGroup/AColorCreateCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AColorCreateCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.CreateColorFromARGBNumberCommand" [ label="CreateColorFromARGBNumberCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AColorCreateCommands" [ label="AColorCreateCommands", style="dashed", ];
"taskt.Core.Automation.Commands.CreateColorFromExcelColorCommand" [ label="CreateColorFromExcelColorCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CreateColorFromHexCommand" [ label="CreateColorFromHexCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CreateColorCommand" [ label="CreateColorCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.CreateColorFromARGBNumberCommand" -> "taskt.Core.Automation.Commands.AColorCreateCommands";
"taskt.Core.Automation.Commands.CreateColorFromExcelColorCommand" -> "taskt.Core.Automation.Commands.AColorCreateCommands";
"taskt.Core.Automation.Commands.CreateColorFromHexCommand" -> "taskt.Core.Automation.Commands.AColorCreateCommands";
"taskt.Core.Automation.Commands.CreateColorCommand" -> "taskt.Core.Automation.Commands.AColorCreateCommands";
}
